<img src="https://ga-dash.s3.amazonaws.com/production/assets/logo-9f88ae6c9c3871690e33280fcf557f33.png" style="float: left; margin: 10px;">
# SQL JOINS

Week 6 | Lesson 2.1

![](https://snag.gy/1UiQa7.jpg)

### LEARNING OBJECTIVES
*After this lesson, you will be able to:*
- explain what a `JOIN` operation is
- visualize a `JOIN` operation as an operation between sets
- distinguish different types of `JOIN`
- perform `JOINS` in `SQL`

### STUDENT PRE-WORK
*Before this lesson, you should already be able to:*
- connect to a local or remote relational database
- perform SQL CRUD and queries
- merging dataframes with Pandas.merge

### LESSON GUIDE
| TIMING  | TYPE  | TOPIC  |
|:-:|---|---|
| 5 mins | [Opening](#opening) | Opening |
| 15 mins | [Introduction](#introduction) | Joining tables |
| 15 mins | [Demo](#demo) | Demo: Different types of JOIN |
| 15 mins | [Guided-practice](#guided-practice) | Guided Practice: Other Joins |
| 15 mins | [Demo](#demo_2) | Demo: Sub-queries |
| 15 minutes | [Ind-practice](#ind-practice) | Independent Practice: Other SQL Commands |
| 5 mins | [Conclusion](#conclusion) | Conclusion |

<a name="opening"></a>
## Opening (5 mins)
In the past week we learned many things about databases, including:

- how to connect to a local or remote db
- how to add, remove, edit data
- how to perform simple queries
- how to aggregate, group and sort data

**Check:** List the  SQL commands you learned last week.
> Answer: SELECT, CREATE, INSERT, DELETE, ALTER, UPDATE, ORDER BY, HAVING, LIKE, DISTINCT, LIMIT ...

However, in many occasions we needed to use data stored in more than one table. Last week we did this using `Pandas merge`, but time has come to learn about _`JOIN`_, which is the natural way to merge data within `SQL`.

<a name="introduction"></a>
## Joining tables (15 mins)

We will use the [Northwind sample database](https://northwinddatabase.codeplex.com/).

As you know, the instructions for connecting are:

    psql -h dsi.c20gkj5cvu3l.us-east-1.rds.amazonaws.com -p 5432 -U dsi_student northwind
    password: gastudents

We will use a few tables from this database, here is what they look like:

`customers`:

|CustomerID |CompanyName |ContactName | ContactTitle |Address|City | Region | PostalCode | Country |Phone | Fax|
|---|
|ALFKI| Alfreds Futterkiste| Maria Anders | Sales Representative | Obere Str. 57 | Berlin|| 12209| Germany | 030-0074321| 030-0076545|
|ANATR| Ana Trujillo Emparedados y helados | Ana Trujillo | Owner| Avda. de la Constitución 2222 | México D.F. || 05021| Mexico| (5) 555-4729 | (5) 555-3745|
|ANTON| Antonio Moreno Taquería| Antonio Moreno | Owner| Mataderos2312 | México D.F. || 05023| Mexico| (5) 555-3932 |
|...|...|...|...|...|...|...|...|...|...|...|

`orders`:

|OrderID | CustomerID | EmployeeID | OrderDate| RequiredDate | ShippedDate | ShipVia | Freight | ShipName|ShipAddress |ShipCity| ShipRegion | ShipPostalCode | ShipCountry |
|----|
|10248 | VINET|5 | 1996-07-04 | 1996-08-01 | 1996-07-16| 3 | 32.38 | Vins et alcools Chevalier | 59 rue de l'Abbaye | Reims|| 51100| France|
|10249 | TOMSP|6 | 1996-07-05 | 1996-08-16 | 1996-07-10| 1 | 11.61 | Toms Spezialitäten| Luisenstr. 48| Münster|| 44087| Germany|
|10250 | HANAR|4 | 1996-07-08 | 1996-08-05 | 1996-07-12| 2 | 65.83 | Hanari Carnes | Rua do Paço, 67| Rio de Janeiro | RJ | 05454-876| Brazil|
|...|...|...|...|...|...|...|...|...|...|...|...|...|

`order_details`:

| OrderID |  ProductID |  UnitPrice | Quantity | Discount |
| ----- |
|10248|11|14|12|0|
|10248|42|9.8|10|0|
|10248|72|34.8|5|0|
|10249|14|18.6|9|0|
|10249|51|42.4|40|0|
|10250|41|7.7|10|0|
|...|...|...|...|...|

### Normalized vs Denormalized data

There are several ways to organize data in a relational database. Two common definitions for data setups are: **normalized** and **denormalized**.

**Normalized** structures have a single table per entity, and use many foreign keys or link tables to connect the entities.

**Denormalized tables** have fewer tables and may (for example) place all of the tweets and the information on users in one table.

Each style has advantages and disadvantages. **Denormalized** tables duplicate a lot of information. For example, in our combined tweets/users table, we may store the address of each user. Now instead of storing this once per user, we are storing this once per tweet!

In the case of tweets with user info including location:

- Easy to query to find location
- Duplicates lots of data

| tweet_id | user_id | tweet | name | location |
|--|--|--|
| 523423423 | 0934 | Mr Spock never drinks the tap water @kiefer. | jeff | NYC |
| 523423424 | 2340 | False, he does when he's thirsty | kiefer | SF |
| 523423425 | 235230 | @kiefer @jeff - surely you need my opinion on this matter | dave | SF |


This is considered **denormalized**

**Normalized** tables save the storage space by separating the information. However, if we ever need to access those two pieces of information, we would need to **join** the two tables, which can be a fairly slow operation, considering we have to write the SQL to get the data.

<br>
<center>`tweets table`</center>
 
| tweet_id | user_id | tweet |
|--|--|--|
| 523423423 | 0934 | Mr Spock never drinks the tap water @kiefer. |
| 523423424 | 2340 | False, he does when he's thirsty |
| 523423425 | 235230 | @kiefer @jeff - surely you need my opinion on this matter |

<br>

<center>`users table`</center>

| user_id | name | location |
|--|--|--|
| 0934 | jeff | NYC |
| 2340 | kiefer | SF |
| 235230 | dave | SF |


This is ideal for larger dataset, where only a reference is needed.

## Our example from the opening:

- Normalized or denormalized?

## Can you make an example of a de-normalized table derived from the ones above?

> Answer: e.g.
>
| OrderID |  ProductID |  UnitPrice | Quantity | Discount | CustomerID | EmployeeID | OrderDate| RequiredDate | ShippedDate | ShipVia | Freight | ShipName|ShipAddress |ShipCity | ShipPostalCode | ShipCountry |
| ----- |
|10248|11|14|12|0| VINET|5 | 1996-07-04 | 1996-08-01 | 1996-07-16| 3 | 32.38 | Vins et alcools Chevalier | 59 rue de l'Abbaye | Reims| 51100| France|
|10248|42|9.8|10|0| VINET|5 | 1996-07-04 | 1996-08-01 | 1996-07-16| 3 | 32.38 | Vins et alcools Chevalier | 59 rue de l'Abbaye | Reims| 51100| France|
|10248|72|34.8|5|0| VINET|5 | 1996-07-04 | 1996-08-01 | 1996-07-16| 3 | 32.38 | Vins et alcools Chevalier | 59 rue de l'Abbaye | Reims| 51100| France|
|10249|14|18.6|9|0| VINET|5 | 1996-07-04 | 1996-08-01 | 1996-07-16| 3 | 32.38 | Vins et alcools Chevalier | 59 rue de l'Abbaye | Reims| 51100| France|
|10249|51|42.4|40|0| VINET|5 | 1996-07-04 | 1996-08-01 | 1996-07-16| 3 | 32.38 | Vins et alcools Chevalier | 59 rue de l'Abbaye | Reims| 51100| France|
|10250|41|7.7|10|0| VINET|5 | 1996-07-04 | 1996-08-01 | 1996-07-16| 3 | 32.38 | Vins et alcools Chevalier | 59 rue de l'Abbaye | Reims| 51100| France|
|...|...|...|...|...|...|...|...|...|...|...|...|...|...|...|...|...|

### Joins

_SQL joins_ are used when data is spread in different tables. A _join_ operation allows to combine rows from two or more tables in a single new table. In order for this to be possible, a common field between the tables need to exist.

**Join operations can be thought of as operations between two sets, where records with the same key are combined and records missing in one set are either discarded or included as NULL values.**

## Have we encountered similar functionality in Pandas?

> Answer:  `merge` function in Pandas.

#### INNER JOIN
The most common type of join is: SQL INNER JOIN (simple join). An SQL INNER JOIN returns all rows from multiple tables where the join condition is met.

Let's consider a few columns of the `orders` table above:

|OrderID|CustomerID|OrderDate|
|---|---|---|
|10308|2|1996-09-18|
|10309|37|1996-09-19|
|10310|77|1996-09-20|

In the `customers` table, let's focus on these columns:

|CustomerID|CompanyName|ContactName|Country|
|---|---|---|---|
|1|Alfreds Futterkiste|Maria Anders|Germany|
|2|Ana Trujillo Emparedados y helados|Ana Trujillo|Mexico|
|3|Antonio Moreno Taquería|Antonio Moreno|Mexico|

Notice that the `CustomerID` column in the `Orders` table refers to the `CustomerID` in the `Customers` table. The relationship between the two tables above is the `CustomerID` column. We can thus _JOIN_ the two tables in order to obtain a table like the following:

|OrderID|CompanyName|OrderDate|
|---|---|---|
|10308|Ana Trujillo Emparedados y helados|9/18/1996|
|10365|Antonio Moreno Taquería|11/27/1996|
|10383|Around the Horn|12/16/1996|
|10355|Around the Horn|11/15/1996|
|10278|Berglunds snabbköp|8/12/1996|

Where the information contained in the two tables is _joined_ in a single table, using the common key of `CustomerID`.

## Restate in your own words what a `JOIN` operation is?

## BONUS:  Think _normalized_ vs _non-normalized_ schemas. 

In which case are `joins` more likely to be necessary?

#### Comparison with Pandas Merge

See [comparison with sql](http://pandas.pydata.org/pandas-docs/stable/comparison_with_sql.html) for a comparison between pandas and SQL and [pandas merging docs](http://pandas.pydata.org/pandas-docs/stable/merging.html#database-style-dataframe-joining-merging) for an in depth review of Pandas merge.

<a name="demo"></a>
## Demo: Different types of JOIN (15 mins)
Given the two tables above, we would like to produce a new table that looks like this:

|OrderID|CompanyName|OrderDate|
|---|---|---|
|10308|Ana Trujillo Emparedados y helados|9/18/1996|
|10365|Antonio Moreno Taquería|11/27/1996|
|10383|Around the Horn|12/16/1996|
|10355|Around the Horn|11/15/1996|
|10278|Berglunds snabbköp|8/12/1996|

where the `OrderID` and `OrderDate` come from the `orders` table and the `CompanyName` comes from the `customers`table. This can be achieve in `SQL` simply using the next statement:

![](https://snag.gy/XDqvry.jpg)

```sql
    SELECT orders."OrderID", customers."CompanyName", orders."OrderDate"
    FROM orders
    INNER JOIN customers
    ON orders."CustomerID"=customers."CustomerID";
```

An **`INNER JOIN`** takes the **intersection** of the two datasets, **excluding the rows** for which `CustomerID` is null in either of the two tables.

## Overview of Joins

![](https://snag.gy/1UiQa7.jpg)

There are several types of join operations.

- INNER JOIN: Returns all rows when there is at least one match in BOTH tables
- LEFT JOIN: Return all rows from the left table, and the matched rows from the right table
- RIGHT JOIN: Return all rows from the right table, and the matched rows from the left table
- FULL JOIN: Return all rows when there is a match in ONE of the tables

It is much easier to understand joins as operations of intersection of sets. In-fact, there's a matematically sound theory behind, called [Relational Algebra](https://en.wikipedia.org/wiki/Relational_algebra), which we won't expand on here, but it's very interesting if you're math inclined.

### Left Join

The LEFT JOIN keyword returns all rows from the left table (table1), with the matching rows in the right table (table2). The result is NULL in the right side when there is no match.

![](https://snag.gy/OB0wor.jpg)

#### Left Join Syntax
```sql
SELECT column_name(s)
FROM table1
LEFT JOIN table2
ON table1.column_name=table2.column_name;
```

## Consider the JOIN we performed above between `orders` and `customers`. 
Which side could contain NULL values in the joined table if we performed a LEFT JOIN?

> Answer: there could be NULL values in the `customers` columns

### Right Join

![](https://snag.gy/hswoMv.jpg)

Similarly, the RIGHT JOIN keyword returns all rows from the right table (table2), with the matching rows in the left table (table1). The result is NULL in the left side when there is no match.

#### Right Join Syntax
```sql
SELECT column_name(s)
FROM table1
RIGHT JOIN table2
ON table1.column_name=table2.column_name;
```

## (Optional) Another type of join:  Cartesian Product

Similiar to a full-outer-join, which is basically a combination of a left and a right join.  A **cartesian product** (aka: cross join) returns all possible combinations of all rows between two or more tables.  It is useful for producing cominbations of matching conditions.
<br><br>

<center>**Customers**</center>

| ID | NAME     | AGE | ADDRESS   | SALARY   | USER_LAT  | USER_LON |
|----|----------|-----|-----------|----------|-----------|----------|
|  1 | Ramesh   |  32 | Ahmedabad |  2000.00 | -119      | 23.33    |
|  2 | Khilan   |  25 | Delhi     |  1500.00 | -123      | 23.33    |
|  3 | kaushik  |  23 | Kota      |  2000.00 | -223      | 23.33    |
|  4 | Chaitali |  25 | Mumbai    |  6500.00 | 55.32     | 23.33    |
|  5 | Hardik   |  27 | Bhopal    |  8500.00 | -23       | 23.33    |
|  6 | Komal    |  22 | MP        |  4500.00 | -2        | 23.33    |
|  7 | Muffy    |  24 | Indore    | 10000.00 | -55       | 23.33    |

<center>**Orders**</center>

|OID  | DATE                | CUSTOMER_ID | AMOUNT | Store_LAT  | Store_LON |
|-----|---------------------|-------------|--------|------------|-----------|
| 102 | 2009-10-08 00:00:00 |           3 |   3000 | -122.234   | 37.29     |
| 100 | 2009-10-08 00:00:00 |           3 |   1500 | -122.223   | 27.52     |
| 101 | 2009-11-20 00:00:00 |           2 |   1560 | -122.223   | 21.23     |  
| 103 | 2008-05-20 00:00:00 |           4 |   2060 | -132.223   | 23.355    |


** Cartesian Product SQL **
```sql
SELECT  ID, NAME, AMOUNT, DATE, USER_LAT, USER_LON, Store_LAT, Store_LON
     FROM CUSTOMERS, ORDERS;
```

One useful case for cartesian products is when doing distance calculations from a user to multiple points such as cities with lat/long points compared to the user.

Another possible usecase for cartesian products is to find every combination of date ranges between two timestamps.  With timeseries problems, this can be useful to find ranges with best possible growth.

<a name="guided-practice"></a>
## Guided Practice: Other Joins (15 mins)

If you remember in lab 3.2, we explored the products, orders and customers tables. However we had to use `pandas.merge` in order to answer questions containing data from multiple tables _(but we talked about how to use joins and ended up making it through without merge)_. Let's see if we can solve them in pure `SQL` now.

## TO THE NOTEBOOK VERSION!

[Here](w6-2.1-sql_joins.ipynb)

In [37]:
from sqlalchemy import create_engine
import pandas as pd

engine = create_engine('postgresql://dsi_student:gastudents@dsi.c20gkj5cvu3l.us-east-1.rds.amazonaws.com:5432/northwind')

In [38]:
## Here's a list of available tables
pd.read_sql("SELECT * FROM pg_catalog.pg_tables WHERE schemaname='public'", con=engine)

,schemaname,tablename,tableowner,tablespace,hasindexes,hasrules,hastriggers
0,public,categories,dsi,None,True,False,False
1,public,customercustomerdemo,dsi,None,True,False,False
2,public,customerdemographics,dsi,None,True,False,False
3,public,customers,dsi,None,True,False,False
4,public,employees,dsi,None,True,False,False
5,public,employeeterritories,dsi,None,True,False,False
6,public,order_details,dsi,None,True,False,False
7,public,orders,dsi,None,True,False,False
8,public,products,dsi,None,True,False,False
9,public,region,dsi,None,True,False,False
10,public,shippers,dsi,None,True,False,False
11,public,shippers_tmp,dsi,None,True,False,False
12,public,suppliers,dsi,None,True,False,False
13,public,territories,dsi,None,True,False,False
14,public,usstates,dsi,None,False,False,False

In [39]:
# Special theme song for group activity..
!afplay /Users/davidyerrington/soundbites/theme.mp3

^C

In [88]:
# Introduction music / theme
!~/play_random_clean.sh

^C

## 1. How many products per category does the catalog contain? 
Print the answer with the `CategoryName`, and `Count`.

In [56]:
sql = """
SELECT "CategoryID", COUNT("ProductName") FROM products 
GROUP BY "CategoryID" 
"""

df = pd.read_sql(sql, con=engine)
df

   CategoryID  count
0           6      6
1           4     10
2           8     12
3           5      7
4           1     12
5           2     12
6           7      5
7           3     13

## 2. What 5 customers are generating the highest revenue? 
Print a table with `CustomerID` and `Total Revenue`. You will need to use data from 3 tables.

In [75]:
sql = """
SELECT * FROM "order_details" LIMIT 10
"""

df = pd.read_sql(sql, con=engine)
df

   OrderID  ProductID  UnitPrice  Quantity  Discount
0    10248         11       14.0        12      0.00
1    10248         42        9.8        10      0.00
2    10248         72       34.8         5      0.00
3    10249         14       18.6         9      0.00
4    10249         51       42.4        40      0.00
5    10250         41        7.7        10      0.00
6    10250         51       42.4        35      0.15
7    10250         65       16.8        15      0.15
8    10251         22       16.8         6      0.05
9    10251         57       15.6        15      0.05

In [ ]:
sql = """
SELECT (
    SELECT bla bla bla FROM table
) AS tablename
"""

In [87]:
sql = """
SELECT or."CustomerID", ROUND(SUM(od."UnitPrice" * od."Quantity")) AS "Revenue"  
FROM "orders" or
JOIN order_details od ON or."OrderID" = od."OrderID"
GROUP BY od."CustomerID"
ORDER BY "Revenue" DESC
LIMIT 5
"""

df = pd.read_sql(sql, con=engine)
df

ProgrammingError: (psycopg2.ProgrammingError) syntax error at or near "or"
LINE 2: SELECT or."CustomerID", ROUND(SUM(od."UnitPrice" * od."Quant...
               ^
 [SQL: '\nSELECT or."CustomerID", ROUND(SUM(od."UnitPrice" * od."Quantity")) AS "Revenue"  \nFROM "orders" or\nJOIN order_details od ON or."OrderID" = od."OrderID"\nGROUP BY od."CustomerID"\nORDER BY "Revenue" DESC\nLIMIT 5\n']

## 3. In which country are the top 5 suppliers by number of units supplied? 
Print a table with the supplier's `CompanyName`, `Country` and total number of units supplied.

In [102]:
sql = """
SELECT * from suppliers
"""

df = pd.read_sql(sql, con=engine)
df.head(3)

,SupplierID,CompanyName,ContactName,ContactTitle,Address,City,Region,PostalCode,Country,Phone,Fax,HomePage
0,1,Exotic Liquids,Charlotte Cooper,Purchasing Manager,49 Gilbert St.,London,None,EC1 4SD,UK,(171) 555-2222,None,None
1,2,New Orleans Cajun Delights,Shelley Burke,Order Administrator,P.O. Box 78934,New Orleans,LA,70117,USA,(100) 555-4822,None,#CAJUN.HTM#
2,3,Grandma Kelly's Homestead,Regina Murphy,Sales Representative,707 Oxford Rd.,Ann Arbor,MI,48104,USA,(313) 555-5735,(313) 555-3349,None

In [126]:
sql = """
SELECT "CompanyName", "Country", SUM("Quantity") AS Total_Quantity
FROM suppliers
JOIN products
ON products."SupplierID" = suppliers."SupplierID"
JOIN order_details
ON order_details."ProductID" = products."ProductID"

GROUP BY suppliers."CompanyName", suppliers."Country"

ORDER BY Total_Quantity DESC
LIMIT 5
"""

df = pd.read_sql(sql, con=engine)
df

                         CompanyName    Country  total_quantity
0  Plutzer Lebensmittelgroßmärkte AG    Germany            4072
1                      Pavlova, Ltd.  Australia            3937
2           Specialty Biscuits, Ltd.         UK            3679
3                       Gai pâturage     France            3073
4                    Norske Meierier     Norway            2526

<a name="demo_2"></a>
## Demo: Sub-queries (15 mins)

SQL is very versatile and it can be stretched a bit further than simple JOIN operations between two different tables.

![](https://pbs.twimg.com/media/BvVRL6nCMAAVRdp.png)

### Subqueries

Also known as: **Subquery** or **Inner query** or **Nested query**

A subquery is a query within another SQL query. There are many ways you can use subqueries, including:

- Restrict data to be retrieved by returning data that will be used in the main query as a condition
- Selecting a specific value part of your `SELECT` parameters before `FROM`
- Scaling values from other tables inside of `ORDER BY`
- Conditional `JOIN` criteria

Subqueries can be used with the SELECT, INSERT, UPDATE, and DELETE statements along with the operators like =, <, >, >=, <=, IN, BETWEEN etc.

#### Syntax

Here is an example of a subquery. The table resulting from the subquery is used as condition in the `WHERE` condition of the main query.

```sql
SELECT some_column
    FROM some_table
    WHERE some_column [Comparison Operator]
        (SELECT different_column
         FROM different_table
         WHERE condition);
```

## Convert this query to a join:

Yes, it is possible.

```sql
SELECT "OrderID", "CompanyName", "OrderDate", FROM orders
WHERE "CustomerID" =
(SELECT "CustomerID"
 FROM customers
 WHERE "Country" = "France")
 ```

<a name="ind-practice"></a>
## Independent Practice: Other SQL Commands (15 minutes)

Work in pairs: go to http://www.w3schools.com/sql and choose a command you have not hear of. Read about it for 5 minutes, then explain it to your pair (take 2.5 minutes turns).

Use the last 5 minutes to share some interesting finds with the rest of the class.

<a name="conclusion"></a>
## Conclusion (5 mins)

In this class we have started to discover the full power of Relational databases through JOINs and sub-queries. These allow us to mix and match data from various tables, in order to extract meaningful results.


### ADDITIONAL RESOURCES

- [SQL Join Documentation](http://www.w3schools.com/sql/sql_join.asp)
- [Relational Algebra](https://en.wikipedia.org/wiki/Relational_algebra)
- [Wikipedia on JOINS](https://en.wikipedia.org/wiki/Join_(SQL))